fonecmid-diplom/src/Documents/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <registerRecords>InformationRegister.ВКМ_УсловияОплатыСотрудников</registerRecords>
  <tabularSections>
    <name>УсловияОплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>DefinedType.ВКМ_Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОтРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/ВКМ_УсловияОплатыСотрудников/ObjectModule.bsl
#Если Сервер Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ВКМ_УсловияОплатыСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаУсловияОплаты из УсловияОплаты Цикл
		Движение = Движения.ВКМ_УсловияОплатыСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаУсловияОплаты.Сотрудник;
		Движение.Оклад = ТекСтрокаУсловияОплаты.Оклад;
		Движение.ПроцентОтРабот = ТекСтрокаУсловияОплаты.ПроцентОтРабот / 100;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
